import{u as s,j as n}from"./entry.client-BaMpz_eH.js";const o="Технічний звіт",c=[],l={title:"Технічне завдання, технічний звіт",lastModifiedTime:"2026-04-14T08:55:50.562Z"},d="pages/techzavd.mdx";function t(e){const r={li:"li",ol:"ol",p:"p",...s(),...e.components};return n.jsxs(n.Fragment,{children:[n.jsx(r.p,{children:"Технічний звіт"}),`
`,n.jsxs(r.ol,{children:[`
`,n.jsx(r.li,{children:`Вступ\r
Призначення: Документ описує вебзастосунок для перегляду,\r
керування та поширення 3D-моделей безпосередньо в браузері без сторонніх плагінів.\r
Мета: Проєктування та розробка системи для взаємодії з тривимірними об’єктами,\r
що забезпечує зручний інтерфейс для звичайних користувачів.`}),`
`,n.jsx(r.li,{children:`Загальний описОб'єкт дослідження:\r
Процес розробки додатка для візуалізації 3D-моделей.\r
Актори системи:\r
Гість: може реєструватися та переглядати галерею.\r
Зареєстрований користувач: має доступ до власного кабінету, може завантажувати та видаляти моделі.\r
Користувач (загальний актор): включає спільні функції перегляду та входу до системи.`}),`
`,n.jsx(r.li,{children:`Функціональні вимоги\r
Система повинна підтримувати наступні функції:\r
FR-1: Підтримка форматів.\r
Робота з файлами типів .GLB, .OBJ, .STL.\r
FR-2: Завантаження моделей.\r
Можливість додавання файлів як з локального пристрою, так і вибір з існуючої галереї.\r
FR-3: Маніпуляції з об'єктами.\r
Перегляд моделей з різних ракурсів: масштабування, обертання та переміщення.\r
FR-4: Налаштування сцени.\r
Можливість увімкнення сітки, осей координат та зміни кольору фону.\r
FR-5: Керування даними. Інтеграція з бекендом для збереження моделей та їх описів у базі даних.`}),`
`,n.jsx(r.li,{children:`Стек технологій та архітектура\r
У роботі обґрунтовано вибір наступного стеку:\r
Frontend: Vue.js (вибрано за реактивність та простоту інтеграції).\r
3D-двигун: Three.js (вибрано як високорівневу бібліотеку над WebGL, що спрощує роботу з камерами, світлом та мешами).\r
Backend: Node.js та Express.js для обробки запитів та логіки авторизації.\r
База даних: MongoDB (використовується для зберігання даних про моделі та користувачів).`}),`
`,n.jsx(r.li,{children:`Проєктування (UML)\r
Для візуалізації логіки системи використано такі діаграми:\r
Діаграма варіантів використання: Описує взаємодію акторів із функціями «Додати модель», «Реєстрація», «Перегляд галереї» тощо.\r
Діаграма діяльності: (Activity diagram) для моделювання бізнес-процесів.\r
Діаграма послідовності: Для опису динамічної взаємодії об'єктів у часі.`}),`
`,n.jsx(r.li,{children:`Нефункціональні вимоги\r
Валідація: Перевірка типів та розмірів файлів під час завантаження.\r
Юзабіліті: Інтуїтивно зрозумілий інтерфейс для кінцевого користувача.\r
Оптимізація: Автоматичне масштабування моделі під розмір сцени.\r
Надійність: Обробка помилок сервера та некоректного введення даних.`}),`
`]})]})}function x(e={}){const{wrapper:r}={...s(),...e.components};return r?n.jsx(r,{...e,children:n.jsx(t,{...e})}):t(e)}export{d as __filepath,x as default,o as excerpt,l as frontmatter,c as tableOfContents};
//# sourceMappingURL=techzavd-CnB5QGJ-.js.map
